package hw4.phone;

import java.util.Comparator;

/**
 * Created by root.
 */
public class Phone {
    private int id;
    private String surname;
    private String name;
    private String middleName;
    private String address;
    private long cardNumber;
    private int debit;
    private int credit;
    private int cityCallsTime;
    private int intercityCallsTime;

    public static Phone[]phones;

    static String[] surnames = {"Смирнов", "Иванов", "Кузнецов", "Соколов", "Попов", "Лебедев", "Козлов", "Новиков", "Морозов", "Петров", "Волков", "Соловьёв", "Васильев", "Зайцев", "Павлов", "Семёнов", "Голубев", "Виноградов", "Богданов", "Воробьёв", "Фёдоров", "Михайлов", "Беляев", "Тарасов", "Белов", "Комаров", "Орлов", "Киселёв", "Макаров", "Андреев", "Ковалёв", "Ильин", "Гусев", "Титов", "Кузьмин", "Кудрявцев", "Баранов", "Куликов", "Алексеев", "Степанов", "Яковлев", "Сорокин", "Сергеев", "Романов", "Захаров", "Борисов", "Королёв", "Герасимов", "Пономарёв", "Григорьев", "Лазарев", "Медведев", "Ершов", "Никитин", "Соболев", "Рябов", "Поляков", "Цветков", "Данилов", "Жуков", "Фролов", "Журавлёв", "Николаев", "Крылов", "Максимов", "Сидоров", "Осипов", "Белоусов", "Федотов", "Дорофеев", "Егоров", "Матвеев", "Бобров", "Дмитриев", "Калинин", "Анисимов", "Петухов", "Антонов", "Тимофеев", "Никифоров", "Веселов", "Филиппов", "Марков", "Большаков", "Суханов", "Миронов", "Ширяев", "Александров", "Коновалов", "Шестаков", "Казаков", "Ефимов", "Денисов", "Громов", "Фомин", "Давыдов", "Мельников", "Щербаков", "Блинов", "Колесников", "Карпов", "Афанасьев", "Власов", "Маслов", "Исаков", "Тихонов", "Аксёнов", "Гаврилов", "Родионов", "Котов", "Горбунов", "Кудряшов", "Быков", "Зуев", "Третьяков", "Савельев", "Панов", "Рыбаков", "Суворов", "Абрамов", "Воронов", "Мухин", "Архипов", "Трофимов", "Мартынов", "Емельянов", "Горшков", "Чернов", "Овчинников", "Селезнёв", "Панфилов", "Копылов", "Михеев", "Галкин", "Назаров", "Лобанов"};
    static String[] names = {"Абрам", "Август", "Авдей", "Аверкий", "Авксентий", "Авраам", "Автоном", "Агап", "Агафон", "Аггей", "Агей", "Адам", "Адриан", "Азарий", " Аким", " Александр", " Алексей", " Амвросий", " Амос", " Ананий", " Анатолий", " Андрей", " Андриан", " Андрон", " Андроник", " Аникей", " Аникита", " Анисим", " Онисим", " Антип", " Антон", " Антонин", " Аполлинарий", " Аполлон", " Арефий", " Аристарх", " Аркадий", " Арсен", " Арсений", " Артем", " Артём", " Артемий", " Архип", " Аскольд", " Афанасий", " Афиноген", " Бажен", " Богдан", " Болеслав", " Борис", " Борислав", " Боян", " Бронислав", " Будимир", " Вадим", " Валентин", " Валерий", " Валерьян", " Варлаам", " Варлам", " Варфоломей", " Василий", " Василиск", " Велимир", " Венедикт", " Вениамин", " Викентий", " Виктор", " Викторин", " Виссарион", " Виталий", " Владилен", " Владлен", " Владимир", " Владислав", " Влас", " Всеволод", " Всемил", " Всеслав", " Вышеслав", " Вячеслав", " Вадим", " Валентин", " Валерий", " Валерьян", " Варлаам", " Варлам", " Варфоломей", " Василий", " Василиск", " Велимир", " Венедикт", " Вениамин", " Викентий", " Виктор", " Викторин", " Виссарион", " Виталий", " Владилен", " Владлен", " Владимир", " Владислав", " Влас", " Всеволод", " Всемил", " Всеслав", " Вышеслав", " Вячеслав", " Гавриил", " Гаврила", " Галактион", " Гедеон", " Геннадий", " Георгий", " Егор", " Герасим", " Герман", " Глеб", " Гордей", " Гостомысл", " Гремислав", " Григорий", " Гурий", " Давыд", " Давид", " Даниил", " Даниил", " Данила", " Дементий", " Демид", " Демьян", " Денис", " Дмитрий", " Добромысл", " Доброслав", " Дорофей "};
    static String[] middleNames = {"Ааронович", "Абрамович", "Августович", "Авдеевич", "Аверьянович", "Адамович", "Адрианович", "Аксёнович", "Александрович", "Алексеевич", "Анатольевич", "Андреевич", "Анисимович", "Антипович", "Антонович", "Ануфриевич", "Арсенович", "Арсеньевич", "Артёмович", "Артемьевич", "Артурович", "Архипович", "Афанасьевич", "Бенедиктович", "Богданович", "Бориславич", "Бориславович", "Борисович", "Брониславович", "Вадимович", "Валентинович", "Валерианович", "Валерьевич", "Валерьянович", "Васильевич", "Венедиктович", "Вениаминович", "Викентьевич", "Викторович", "Виленович", "Вилорович", "Витальевич", "Владиленович", "Владимирович", "Владиславович", "Владленович", "Власович", "Всеволодович", "Вячеславович", "Гавриилович", "Гаврилович", "Геннадиевич", "Георгиевич", "Герасимович", "Германович", "Гертрудович", "Глебович", "Гордеевич", "Григорьевич", "Гурьевич", "Давидович", "Давыдович", "Даниилович", "Данилович", "Демидович", "Демьянович", "Денисович", "Димитриевич", "Дмитриевич", "Дорофеевич", "Евсеевич", "Евстигнеевич", "Егорович", "Елизарович", "Елисеевич", "Еремеевич", "Ермилович", "Ермолаевич", "Ерофеевич", "Ефимович", "Ефимьевич", "Ефремович", "Ефстафьевич", "Жанович", "Жоресович", "Захарьевич", "Зиновьевич", "Игнатович", "Игнатьевич", "Игоревич", "Измаилович", "Изотович", "Иларионович", "Ильич", "Ильясович", "Иосипович", "Иосифович", "Исидорович", "Марсович", "Матвеевич", "Михайлович", "Петрович", "Семёнович", "Сидорович", "Тарасович", "Теймуразович", "Терентьевич", "Тимурович", "Тихонович", "Трифонович", "Трофимович", "Устинович", "Фадеевич", "Фёдорович", "Федосеевич", "Федосьевич", "Федотович", "Феликсович", "Феодосьевич", "Феоктистович", "Феофанович", "Филатович", "Филимонович", "Филиппович", "Фокич", "Фомич", "Фролович", "Харитонович", "Харламович", "Харлампович", "Харлампьевич", "Чеславович", "Эдгардович", "Эдгарович", "Эдуардович", "Юлианович"};
    static String[] cities = {"Киев", "Харьков", "Одесса", "Днепропетровск", "Донецк", "Запорожье", "Львов", "Кривой Рог", "Николаев", "Мариуполь", "Луганск", "Севастополь", "Винница", "Макеевка", "Симферополь", "Херсон", "Полтава", "Чернигов", "Черкассы", "Житомир", "Сумы", "Хмельницкий", "Горловка", "Ровно", "Кировоград", "Днепродзержинск", "Черновцы", "Кременчуг", "Ивано-Франковск", "Тернополь", "Белая Церковь", "Луцк", "Краматорск", "Мелитополь", "Керчь", "Никополь", "Северодонецк", "Славянск", "Бердянск", "Ужгород", "Алчевск", "Павлоград", "Евпатория", "Лисичанск", "Каменец-Подольский"};

    public int getId() {
        return id;
    }
    public void setId(int id) {
        this.id = id;
    }

    public String getSurname() {
        return surname;
    }
    public void setSurname(String surname) {
        this.surname = surname;
    }

    public String getName() {
        return name;
    }
    public void setName(String name) {
        this.name = name;
    }

    public String getMiddleName() {
        return middleName;
    }
    public void setMiddleName(String middleName) {
        this.middleName = middleName;
    }

    public String getAddress() {
        return address;
    }
    public void setAddress(String address) {
        this.address = address;
    }

    public long getCardNumber() {
        return cardNumber;
    }
    public void setCardNumber(long cardNumber) {
        this.cardNumber = cardNumber;
    }

    public int getDebit() {
        return debit;
    }
    public void setDebit(int debit) {
        this.debit = debit;
    }

    public int getCredit() {
        return credit;
    }
    public void setCredit(int credit) {
        this.credit = credit;
    }

    public int getCityCallsTime() {
        return cityCallsTime;
    }
    public void setCityCallsTime(int cityCallsTime) {
        this.cityCallsTime = cityCallsTime;
    }

    public int getIntercityCallsTime() {
        return intercityCallsTime;
    }
    public void setIntercityCallsTime(int intercityCallsTime) {
        this.intercityCallsTime = intercityCallsTime;
    }

    public Phone(int id, String surname, String name, String middleName, String address, long cardNumber, int debit, int credit, int cityCallsTime, int intercityCallsTime) {
        this.id = id;
        this.surname = surname;
        this.name = name;
        this.middleName = middleName;
        this.address = address;
        this.cardNumber = cardNumber;
        this.debit = debit;
        this.credit = credit;
        this.cityCallsTime = cityCallsTime;
        this.intercityCallsTime = intercityCallsTime;
    }

    public Phone(int id){
        this.id = id;
        this.surname = surnames[random(0,(surnames.length - 1))];
        this.name = names[random(0,(names.length - 1))];
        this.middleName = middleNames[random(0,(middleNames.length - 1))];
        this.address = cities[random(0,(cities.length - 1))];
        this.cardNumber = random(1000000000000000l,9999999999999999l);
        this.debit = random(0,1000);
        this.credit = random(0,1000);
        this.cityCallsTime = random(1,666);
        this.intercityCallsTime = random(0,10);
    }

    @Override
    public String toString() {
        return "["+id+" "+surname+" "+name+" "+middleName+" г. "+address+" ["+cardNumber+"] "+
                debit+" грн. "+ credit+" грн. "+cityCallsTime+" мин "+intercityCallsTime+" мин ]";
    }

    public static int random(int first, int last){
        return (first) + (int) (Math.random() * (((last) - (first)) + 1));
    }

    public static long random(long first, long last){
        return (first) + (long) (Math.random() * (((last) - (first)) + 1));
    }

    public class PhoneSurnameComparator implements Comparator<Phone>{

        @Override
        public int compare(Phone o1, Phone o2) {
            return o1.getSurname().compareTo(o2.getSurname());
        }
    }
}
